{
  "main": {
    "name":"Kevin Pruvost",
    "description":"Hello 🤗 ! I'm a student in Computer Science passionate about Software Engineering, Computer Graphics and Low-Level Programming",
    "image":"profilepic.jpg",
    "bio":"I am a passionate and hardworking developer 👨‍💻, with a team working spirit 👨‍👨‍👦‍👦.\nI developped an interest through my years of coding in Software Engineering, AI, Game Development, Low Level Programming and Computer Graphics. I'm focusing the rest of my studies on these subjects, and for that, I'm currently preparing myself for a year of studies abroad 🧳, in the Tsinghua University, where they teach all of these subjects. For my future career, my ultimate wish is to get a job in one of these specialties, in a company with passionate people from every levels of experience, where everybody wants to share their knowledge and where team work is at its best, in terms of fun but also of efficiency.",
    "contactmessage":"Do not hesitate to contact me, via email ✉️ or phone call ☎️, I'll answer with great pleasure.",
    "email": "pruvostkevin0@gmail.com",
    "phone": "+33 (0)6 88 05 40 78",
    "github":"https://github.com/kevinpruvost",
    "linkedin":"https://www.linkedin.com/in/kevin-pruvost-3766a4178/",
    "address":{
      "street":"29 bis rue des Jardiniers",
      "city":"Nancy",
      "state":"Grand Est, France",
      "zip": "54000"
    },
    "website": "http://www.timbakerdev.com",
    "enResumedownload":"https://raw.githubusercontent.com/kevinpruvost/portfolio/main/Resumes/Kevin_Pruvost_Resume_EN.pdf",
    "frResumedownload":"https://raw.githubusercontent.com/kevinpruvost/portfolio/main/Resumes/Kevin_Pruvost_Resume_FR.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/kevin-pruvost-3766a4178/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/kevinpruvost",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here is a list of some of my favorite libraries/softwares I like to work with.",
    "education":[
      {
        "school":"EPITECH, Nancy · France",
        "degree":"Masters in IT (Expert en Technologies de l'Information)",
        "graduated":"2018 - 2023",
        "logo":"epitech.png",
        "link":"https://www.epitech.eu/",
        "description":"Mathematics, Unix Systems, Shell, Multithreading, Functional Programming, AI, GUI, Dynamic Linking, Low-Level Programming, Computer Graphics (SFML, SDL, CSFML, OpenGL), Web & Mobile Development."
      },
      {
        "school":"Lycée Jacques-Marie Boutet de Monvel,\nLunéville · France",
        "degree":"High School Diploma in Sciences (Baccalauréat Scientifique)",
        "graduated":"2015 - 2018",
        "logo":"highschool.png",
        "link":"https://lyc-boutet-de-monvel.monbureaunumerique.fr/",
        "description": "Option : Computer & Digital Sciences (Informatique et Sciences du Numérique)"
      }
    ],
    "work":[
      {
        "company":"RhinoTerrain, Nancy",
        "title":"Internship - C++ Developer",
        "years":"April 2021 - July 2021",
        "logo":"rhinoterrain.png",
        "link":"https://www.rhinoterrain.com/fr/",
        "description":[
          "Currently in internship with them."
        ]
      },
      {
        "company":"Virtual Rangers, Luxembourg",
        "title":"Internship - C# / Unity Developer",
        "years":"September 2020 - January 2021",
        "logo":"vrangers.png",
        "link":"https://virtual-rangers.com/",
        "description":[
          "Development of mobile games for events organized by professional clients, like BIL (a luxembourgish bank).",
          "Worked on Augmented Reality & Virtual Reality applications and games.",
          "Worked on databases, web applications and on the development of a REST API in order to create an environment where our projects could interact with each other."
        ]
      },
      {
        "company":"Vivoka, Metz · France",
        "title":"Internship - C++ Developer",
        "years":"July 2019 - December 2019",
        "logo":"vivoka.png",
        "link":"https://vivoka.com/fr/",
        "description":[
          "Development of a project template builder GUI in C++, capable of building new projects a lot faster, adding other projects' code or submodules from Gitlab.",
          "Development of a TV program module and a Translation module for a vocal assistant (AI) in C++."
        ]
      }
    ],
    "skills":[
      {
        "name":"💛 C++ 💛",
        "description":"My absolute favorite language and also the one I'm the most experienced with. I enjoy coding in C++ because of how complex yet creative it can be. I feel like I can do anything with C++ and that's why I love it.",
        "image":"c++.png"
      },
      {
        "name":"💙 Python 💙",
        "description":"My second preferred language, it could be seen as pretty contradictory considering that my favorite language is C++. But the large variety of syntaxic sugars it has makes it much funnier to code for me.",
        "image":"python.png"
      },
      {
        "name":"C#",
        "description":"The second language I'm the most experienced with. I made a several number of projects in C# including 2 on my internships. I think it's a great and easy language to work with.",
        "image":"csharp.png"
      },
      {
        "name":"💜 JavaScript 💜",
        "description":"My favorite web language. Mainly because of how easy it is to start with, but also because of how fast you can write code. I had the opportunity to work on the Front-End of some projects, including one during my internships.",
        "image":"javascript.png"
      },
      {
        "name":"React JS",
        "description":"My favorite JS front framework so far, I've worked with it on multiple projects including this portfolio, and I really enjoy its ease of use and its simplicity.",
        "image":"react.png"
      },
      {
        "name":"Laravel",
        "description":"I use Laravel, mainly to make the back-end part of my web projects. As the documentation, the templates and the overall code available is pretty clear and practical to use.",
        "image":"laravel.png"
      },
      {
        "name":"Unity",
        "description":"My favorite game engine at the moment. Also the one I use the most. I like Unity for its ease of use and its fast learning curve.",
        "image":"unity.png"
      },
      {
        "name":"Unreal Engine 4",
        "description":"As well as my love of Python vs. C++, I think pretty much the same about Unity vs. Unreal Engine. The only different point is that I practiced Unreal Engine less because of its needs in terms of performance.",
        "image":"ue4.png"
      },
      {
        "name":"Vulkan",
        "description":"I'm still discovering this graphics API, but I love it for the control it gives, its performance and the cross-platform capacities it has. I followed a very long course on Vulkan and I'll continue to work on it.",
        "image":"vulkan.png"
      },
      {
        "name":"OpenGL",
        "description":"I'm learning OpenGL at the same time as Vulkan, because I find it easier to implement, but I know most companies still want to work with OpenGL, but also DirectX and Vulkan, so to stay up to date, I'm learning both of them, DirectX is for later :)",
        "image":"opengl.png"
      },
      {
        "name":"Qt",
        "description":"I used to work on Qt for a small bunch of projects. I got some professional experience with Qt on my first internship where Qt was one of their core libraries.",
        "image":"qt.png"
      },
      {
        "name":"Git",
        "description":"I used Git for all of my projects, whether it was with companies, for personal projects or for school projects.",
        "image":"git.png"
      },
      {
        "name":"Perforce",
        "description":"I'm still a beginner with the Perforce tools. I'm trying it out with some of my personal projects. I found out that some big companies use it because of how powerful and practical Perforce tools can be.",
        "image":"perforce.png"
      },
      {
        "name":"SVN",
        "description":"I used SVN for some projects within the companies I worked with.",
        "image":"svn.png"
      },
      {
        "name":"Visual Studio",
        "description":"By far, my favorite IDE, I use it for all of my C++ and C# projects. I love its adaptation and customization capabilities and also its implementation of CMake. It's so efficient & practical that I can't work without it.",
        "image":"vs.png"
      },
      {
        "name":"Visual Studio Code",
        "description":"As a lighter version of Visual Studio but also more polymorphic, I use it whenever I have to work on every other languages than C++, C# and Python.",
        "image":"vscode.png"
      },
      {
        "name":"PyCharm",
        "description":"My favorite Python IDE. I really like this one for its huge number of features related to Python, pip, ...",
        "image":"pycharm.png"
      },
      {
        "name":"Emacs",
        "description":"The first IDE I coded with. I'm not using it anymore nowadays, but it's a good souvenir to keep.",
        "image":"emacs.png"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title": "2021",
        "projects": [
          {
            "title":"GreedyBoy 💰",
            "category":"Automated cryptocurrencies trading bot made with Python. GreedyBoy is made to run on AWS Lambda servers 24/7, it also uses the Kraken API in order to make cryptocurrency orders.",
            "image":"greedyboy.jpg",
            "url":"https://kevinpruvost.github.io/GreedyBoy/"
          },
          {
            "title":"TempoGuessr 🦍",
            "category":"A game we made for a JAM in less than 1 day with Unity (C#). In TempoGuessr, you play a time travelling gorilla whose target is to learn how to recognize in which timeline he is located 👨‍🔬. And for that, you will have to place in the correct order 3 images of the same place.",
            "image":"tempoguessr.jpg",
            "url":"https://github.com/kevinpruvost/TempoGuessr"
          },
          {
            "title":"Google Hash Code 2021 🏆",
            "category":"A world wide programming contest organized by Google. Our team's name is Euclid Engine. We managed to get in the Top 3.9% (360th) in the world, and we got the 24th place among the french contestants.",
            "image":"hashcode2021.jpg",
            "url":"https://codingcompetitions.withgoogle.com/hashcode/archive/2021"
          }
        ]
      },
      {
        "title": "2020",
        "projects": [
          {
            "title":"Babel 📞",
            "category":"A online vocal and text chat software (Skype-like) we made with Qt and Boost.",
            "image":"babel.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/ThirdYear/Babel"
          },
          {
            "title":"Dashboard 🎫",
            "category":"A dashboard containing multiple online widgets gathering informations from different APIs, made with React JS / Laravel. For instance, there's a Coinbase widget showing the amount of Bitcoin you have on your wallet or a widget showing you the weather, ...",
            "image":"dashboard.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/ThirdYear/Dashboard"
          },
          {
            "title":"R-Type 👨‍💻",
            "category":"A game engine made in C++ with the SFML and Boost libraries. We used the ECS architecture (Entities Components Systems). The game engine has network, multithreading, dynamic linking and game loops abilities. We also made a small game which looks like the R-Type game.",
            "image":"r-type.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/ThirdYear/R-type"
          },
          {
            "title":"Epicture 🖼️",
            "category":"A mobile application containing interactions and informations from the Imgur API, bound with the OAuth system. The application was made with Kotlin.",
            "image":"epicture.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/ThirdYear/Epicture"
          }
        ]
      },
      {
        "title": "2019",
        "projects": [
          {
            "title":"Zerggy 🌸",
            "category":"A very special game gathering a lot of technical notions, we had to develop some advanced AI algorithms, network and graphics in C++. Zerggy is an online game where only AIs can play, the purpose of it is to make AIs from other players online compete in an arena, where some little monsters must gather resources, make children, level up by combining themselves, to get to the maximum level. The graphics were heavily inspired by Carbot and Starcraft.",
            "image":"zerggy.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/SecondYear/PSU_2019/PSU_zappy_2019"
          },
          {
            "title":"🚀 Swallow my Junk 🍽️",
            "category":"A game we made for a JAM with the SFML library in C++. In this game, you are a black hole that has to eat the most junk it encounters in order to survive. We chose this idea because we wanted to try out some special effects algorithms.",
            "image":"junk.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/SecondYear/JAM_space_2019"
          },
          {
            "title":"Des Freds & des Fourchettes 🍕",
            "category":"A small application whose purpose was to make me learn about multiprocessing and multithreading technical notions (in C++). We had to create a pizza restaurant with kitchens (processes) and cooks (threads). We made a graphical representation of what happens in the program with the SFML library.",
            "image":"freds.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/SecondYear/CCP_plazza_2019"
          }
        ]
      },
      {
        "title": "2018",
        "projects": [
          {
            "title":"Acheron's War 🔮",
            "category":"An RPG containing a mix of many references of films and games made with the CSFML library in C.",
            "image":"rpg.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/FirstYear/MUL_2018/MUL_my_rpg_2018"
          },
          {
            "title":"Shrek Tower Defense 🕹️",
            "category":"A Tower Defense game in the Shrek style made with the CSFML library in C.",
            "image":"shrektowerdefense.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/FirstYear/MUL_2018/MUL_my_defender_2018"
          },
          {
            "title":"Shrekometry Dash ⏹️",
            "category":"A platformer game inspired by Geometry Dash and Shrek, made with the CSFML library in C.",
            "image":"shrekometry.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/FirstYear/MUL_2018/MUL_my_runner_2018"
          },
          {
            "title":"Canard Hunt 🦆",
            "category":"A Duck Hunt like game made with the CSFML library in C.",
            "image":"canardhunt.jpg",
            "url":"https://github.com/kevinpruvost/kevinpruvost_epitech/tree/master/FirstYear/MUL_2018/MUL_my_hunter_2018"
          }
        ]
      }
    ]
  }
}
